trade_exp/src/Documents/ЛистСогласования/ЛистСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЛистСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bd7ea247-d70a-4d92-8cd1-47dd38150946">
    <name>ЗадолженностьПоДоговору</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3512a52c-9acd-45aa-804a-ca5be089f33f">
    <name>ЗадолженностьПоПартнеру</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0bc5285-0919-4f85-a76a-917121dc97f7">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89f1256b-558f-47e6-9ac4-50effd1ea3da">
    <name>ДатаИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e3352f3-d5d8-490e-bf93-180010c0e2bc">
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2aa8b804-d300-40d4-8612-ffc4be650575">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ea323fd-1fd1-401c-8754-d23f642bbee1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e25d6271-38c5-420f-857c-1046650bddb2">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb42b1f-fbbe-48cd-b72e-a17e84f5b3fd">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2969a8aa-a5b3-4ce7-81b3-c196f690ff12">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2664f229-27c5-4ab7-bdcc-6e1f12591738">
    <name>Исполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79deed0e-4a1e-4e98-abff-d97cca969ea3">
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd483cea-3167-4be8-9a7b-907195fed864">
    <name>ОплатаДо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a82a6d7e-91c4-476b-846d-35797a773436">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c21d35e3-631d-41e4-97ad-6641158d01f1">
    <name>Согласователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64f86b4c-7d54-46b4-ac7a-f66b7c8a4ed3">
    <name>ДатаРегистрацииИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61d8cf96-a87b-4b3f-82bd-f47b88a0a6b2">
    <name>ДатаРегистрацииСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9696be9-259d-48d2-acae-a488245743b7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7a11fe18-5ed9-4686-81a4-2c953068f858">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0e10f187-eed8-4a74-ad3f-41977c655684">
    <name>ОстатокДоступногоЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a49d888-bd7f-4334-8ff8-e93a57cb570a">
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="526eac68-cb4b-4908-bc13-1a77e20acbf6">
    <name>Аннулирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc47dd80-4fa8-4382-85cc-0bb2a6ea2344">
    <name>ДатаРегистрацииАннулирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb1f6b46-b63a-41b8-be2a-95d8f14c5069">
    <name>ПользовательАннулировал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="061685f0-091a-457d-9c28-92025f6c5b4f">
    <name>СуммаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0bf38673-8ec2-4f32-8979-463fb5698aa6">
    <name>ДокументыСданы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0147949-9ac7-484e-a0ca-8b34f672cff8">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="164c893d-909d-49d8-a7ba-800c18b6d039">
    <name>ДатаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f4b22395-72bb-4776-b524-cfb53c57a4f4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="550c31a7-7fbc-4734-a07f-2c1c7740b581">
    <name>АвторДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ad8094-987b-4a04-be24-8dfc5c80007b">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="233e2c0e-f8f8-4b89-8226-26d79824c73b">
    <name>ТелефонВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9d617b0f-530e-468c-9892-04f5cb814fd8">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67a5e386-695b-4a2d-b797-85e8575cd0d9">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adf90053-7b0e-4c0c-b68f-dea98e3d5512">
    <name>ЗакрывающийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b202c1c5-6f08-4c5a-a971-994b3a823381">
    <name>ПричинаАнулирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f48d72a7-688f-4060-9471-78ce17ef6985">
    <name>ДокументыСданыКомментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="651738b7-f1d8-42b6-8715-ecf95d1cf2e6">
    <name>СогласованиеПросроченнойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1bc5b57-b12c-4d9d-8031-2f2f4a41c589">
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4441e03a-af91-4f94-b3af-ef3e1da779c9">
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="311a625c-24d8-4904-b476-ab8a851af32e">
    <name>ДатаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af9eb79a-5875-48dd-a78f-f6b647d35e28">
    <name>СчетФактура</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="29b69425-b470-40ba-a4e7-ccf20f0881a0">
    <name>ОтправленоСогласователю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb028d7b-43a8-477f-9304-ad8ecc5530a4">
    <name>ДатаПередачиВБухгалтерию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1900bbe4-7fbe-47c9-9810-e3bd898afe33">
    <name>СтатусЛистаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ce52be8e-dbd2-4c4b-b7a7-611e5ca5521c">
    <name>ЕстьМаркированныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a9084dcf-265d-4098-820d-eccd4153f5d6">
    <name>ОтправленоМенеджеру</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="07c7c64e-3afa-4b32-b3c3-4aca4478e4e0">
    <name>Проблемы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="78b64a6c-b2f2-484c-8326-b668f1343f0e">
      <name>ПроблемаРасшифровка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6bf3592f-8fd6-4297-970c-6377faa8eec4">
      <name>Выполнено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f315772c-11c4-4d38-86f9-344a698693fe">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d53e5c9-911b-4810-b8d1-7e5cf4d442c8">
  <name>Удержания</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="6cbacd10-1223-48c2-8695-eb624272b705">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d41a7967-81fb-464b-87dc-fad4c0eb575f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="441ad33d-ec2b-442a-b6f1-d2f8f9571a10">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a571e0c2-1cdc-4e8c-b3f4-d6f22838e55c">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="063b3a13-df87-44be-976e-25da34f40d6e">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c5dca119-88ef-4e61-b6e5-3917fe28b599">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bc62299-cfbd-4b49-b31c-5a1e0e83824d">
    <name>Периодический</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e2b90059-59db-43b4-8a12-ae8522d97ffd">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4246bf06-45ee-4f7b-9f7d-37cc4e74a99b">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/ИзросходованныйЛимитСогласования/ИзросходованныйЛимитСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="84d4855a-c04c-421e-af2a-52357b9b8684">
  <name>ИзросходованныйЛимитСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="1688eedf-3205-4476-9e03-48e45d76de4d">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="81de6b3a-b2f5-4169-8d9a-e843e1c617d8">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3bbec9f4-7f47-46b0-a225-840534cba128">
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/ЛистСогласования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	Автор = Пользователи.ТекущийПользователь();
	
	Документы.ЛистСогласования.ЗаполнитьДанныеПоОснованию(ДанныеЗаполнения, ЭтотОбъект);
	
КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
		Если Не ЗначениеЗаполнено(Проблема) Тогда
			ПроверяемыеРеквизиты.Добавить("Проблема");
		КонецЕсли;
	КонецЕсли;
	
	Если Исполнен Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаИсполнения");
	КонецЕсли;
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		ЗаписатьВРегистр();
		Возврат;
	КонецЕсли;
	
	Если Не ЛистыСогласованияСервер.ИмеетПолныеПрава() Тогда
		
		Если ДопМодульСервер.ЭтоКассовыйДокументПоЛистуСогласования(Основание) Тогда
			ОтметкаКассы = ЗначениеЗаполнено(Основание.Кассир) И Не РольДоступна("ОтменаЛистовСогласованияСОтметкойКассы");
		Иначе
			ОтметкаКассы = Ложь;
		КонецЕсли;  
		
		//Запись Пометка удаления
		Если ПометкаУдаления Тогда
			Отказ = Истина;
			Сообщить("Нет прав на удаление!");
		КонецЕсли;
		
		//Проверим нет ли других листов
		Если Не Аннулирован Тогда
			
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда
				Отказ = Отказ ИЛИ ЛистыСогласованияСервер.ЕстьДругиеЛистыПоЗадолженности(ЭтотОбъект);
			КонецЕсли;
			
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов Тогда
				Отказ = Отказ ИЛИ ЛистыСогласованияСервер.ЕстьДругиеЛистыПоТранзитам(ЭтотОбъект);
			КонецЕсли;
			
		КонецЕсли;
		
		//Проверки по статусам
		Если (Аннулирован ИЛИ Ссылка.Аннулирован) И (Согласован ИЛИ Ссылка.Согласован) Тогда
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности И Не ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоЗадолженности() Тогда
				Сообщить("Нет прав на аннулирование листов согласования!");
				Отказ = Истина;
			КонецЕсли;
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов И Не ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоТранзитам() Тогда
				Сообщить("Нет прав на аннулирование листов согласования!");
				Отказ= Истина;
			КонецЕсли;
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления И Не ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоОформлению() Тогда
				Сообщить("Нет прав на аннулирование листов согласования!");
				Отказ = Истина;
			КонецЕсли;
			
			Если Ссылка.Аннулирован И Не Аннулирован Тогда //значит снята галочка
				Если ОтметкаКассы Тогда 
					Сообщить("У документа основания установлена отметка кассы!");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли (Исполнен ИЛИ Ссылка.Исполнен) И Не (Аннулирован ИЛИ Ссылка.Аннулирован) Тогда
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности И Не ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоЗадолженности() Тогда
				Сообщить("Нет прав на исполнение!");
				Отказ = Истина;
			КонецЕсли;
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов И Не ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоТранзитам() Тогда
				Сообщить("Нет прав на исполнение!");
				Отказ = Истина;
			КонецЕсли;
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления И Не ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоОформлению() Тогда
				Сообщить("Нет прав на исполнение!");
				Отказ = Истина;
			КонецЕсли;     
			
			Если Ссылка.Исполнен И Не Исполнен Тогда
				Если ОтметкаКассы Тогда 
					Сообщить("У документа основания установлена отметка кассы!");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли (Согласован ИЛИ Ссылка.Согласован) И (Согласован <> Ссылка.Согласован) И Не (Аннулирован ИЛИ Ссылка.Аннулирован) И Не (Исполнен ИЛИ Ссылка.Исполнен) Тогда
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности И Не ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоЗадолженности() Тогда
				Сообщить("Нет прав на согласование!");
				Отказ = Истина;
			КонецЕсли;
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов И Не ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоТранзитам() Тогда
				Сообщить("Нет прав на согласование!");
				Отказ = Истина;
			КонецЕсли;
			Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления И Не ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоОформлению() Тогда
				Сообщить("Нет прав на согласование!");
				Отказ = Истина;
			КонецЕсли;
			
			Если Согласовано.Пользователь <> Пользователи.ТекущийПользователь() И Не ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовЗаДругого() Тогда
				Сообщить("Не вы согласовывали лист!");
				Отказ = Истина;
			КонецЕсли;
			
			Если Ссылка.Согласован И Не Согласован Тогда
				Если ОтметкаКассы Тогда 
					Сообщить("У документа основания установлена отметка кассы!");
					Отказ = Истина;;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если  ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности И НЕ ДополнительныеСвойства.Свойство("ПрограммноеСозданиеЛиста") Тогда
			Если СуммаСогласования <= СуммаОплаты и Не Аннулирован  Тогда
				Отказ= Истина;
				Сообщить("Сумма согласования <= Сумма оплаты");
			КонецЕсли;
		КонецЕсли;
		
		Если СуммаСогласования < 0 Тогда
			Отказ = Истина;
			Сообщить("Сумма согласования не может быть меньше нуля!");
		КонецЕсли;
		Если СуммаОплаты < 0 Тогда
			Отказ = Истина;
			Сообщить("Сумма оплаты не может быть меньше нуля!");
		КонецЕсли;
		
		// изменение
		Если  ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности или
			ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов	Тогда 
			Если ОстатокДоступногоЛимита<=0 И Согласован Тогда
				Отказ = Истина;
				Сообщить("Пользователю не разрешено согласовывать задолженность!");
			КонецЕсли;
		КонецЕсли;
		
		Если Исполнен И Не Согласован Тогда
			Сообщить("Документ ещё не согласован!");
			Отказ = Истина;
		КонецЕсли;
		
		Если Аннулирован И (Согласован ИЛИ Исполнен) Тогда
			Сообщить("Прежде чем аннулировать нужно отменить согласование или исполнение!");
			Отказ = Истина;
		КонецЕсли;		
		
		Если  ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов Тогда
			
			Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ЗаказКлиента") Тогда 
				Отказ = Истина;
				Сообщить("Согласование транзитов возможно только на основании Заказа клиента!");
			КонецЕсли;
		КонецЕсли;
		
		Если  ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов Тогда  	
			Если НачалоДня(ОплатаДо) < НачалоДня(Дата) Тогда
				Отказ = Истина;
				Сообщить("Дата оплаты меньше даты листа согласования!");
			КонецЕсли; 			
		КонецЕсли;	                               
		
		//Проверка на менеджеров Задача Тупициной
		Если Найти(ОсновнойМенеджер.Наименование, "Сектор выписки") > 0 Тогда
			Отказ = Истина;
			Сообщить("Основным менеджером не может быть Сектор выписки!");
		КонецЕсли;
		
		Если ОсновнойМенеджер.Недействителен Или ОсновнойМенеджер.ПометкаУдаления Тогда
			Сообщить("Учетная запись ответственного менеджера отключена или удалена. Укажите действующего менеджера.");
			Отказ = Истина;
		КонецЕсли;
		
		Если Не Отказ И ЗначениеЗаполнено(ОсновнойМенеджер) И НЕ ДополнительныеСвойства.Свойство("ПрограммноеСозданиеЛиста") Тогда 
			УстановитьПривилегированныйРежим(истина);
			ПрочитанныеСвойства = Пользователи.СвойстваПользователяИБ(ОсновнойМенеджер.ИдентификаторПользователяИБ);
			Если ПрочитанныеСвойства <> Неопределено И Не Пользователи.ВходВПрограммуРазрешен(ПрочитанныеСвойства) Тогда	
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю("Ответственному запрещена работа в 1С. Выберите другого ответственного");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	ЕстьМаркированныйТовар=ЕстьМаркированныйТовар(ЭтотОбъект.Основание);
КонецПроцедуры                   

Функция ЕстьМаркированныйТовар(Основание)  
	//если значениезаполнено(Основание) тогда
	//	ТипДокумента=Основание.Метаданные().имя ;
	//иначе     
	//	Возврат ложь;
	//конецесли;	          
	//если не (ТипДокумента="РеализацияТоваровУслуг" или ТипДокумента="ЗаказКлиента") тогда
	//	возврат ложь;
	//конецесли;	
	//если Основание.Метаданные().ТабличныеЧасти.Найти("Товары") = НЕОПРЕДЕЛЕНО тогда
	//	Возврат Ложь;
	//конецесли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &Ссылка
	|	И Документ.Номенклатура.ВидНоменклатуры.ПродукцияМаркируемаяДляГИСМ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Документ.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &Ссылка
	|	И Документ.Номенклатура.ВидНоменклатуры.ПродукцияМаркируемаяДляГИСМ";
	
	Запрос.УстановитьПараметр("Ссылка", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	возврат  не РезультатЗапроса.Пустой();
	
	
КонецФункции // ()


&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЗаписатьВРегистр();
	
	
	ПроверитьФормуОплатыДатуДоставкиНаСервере(Истина);
	
	Если НЕ ОтправленоСогласователю И НЕ Согласован И АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда
		
		 Сотрудник = Ссылка.Согласовано.Пользователь;
		 НавСсылка = ПолучитьНавигационнуюСсылку(Ссылка);
		 
		 ТелоСообщения = "Требуется согласовать "+ Ссылка + " !" + Символы.ПС + НавСсылка;
		 
		 Результат = АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТелоСообщения, Сотрудник);		
		 
		 Если Результат <> Неопределено Тогда 
			 ОтправленоСогласователю = Истина;
		 Иначе
			 Сообщить("Не получилось отправить данные в Битрикс!");
		 КонецЕсли; 
		 
	КонецЕсли;	
	
	Если Отказ <> Истина Тогда
		УведомлениеПоСогласованиюТранзитов()
	КонецЕсли;
	
КонецПроцедуры

Процедура УведомлениеПоСогласованиюТранзитов()
	Если Согласован И НЕ ОтправленоМенеджеру Тогда
	    Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеТранзитов") Тогда
	        
	        Если Основание.Товары.Количество() <> 0 Тогда
	            АвторЗаказа = Основание.Автор;    
	            НомерЗадачи = НайтиНомерЗадачи(Основание.Комментарий);            
	            
	            Запрос = Новый Запрос;
	            Запрос.Текст = 
	            "ВЫБРАТЬ РАЗЛИЧНЫЕ
	            |    ЗаказКлиентаТовары.Номенклатура.МенеджерПоставок КАК МенеджерОП
	            |ИЗ
	            |    Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	            |ГДЕ
	            |    ЗаказКлиентаТовары.Ссылка = &Ссылка
	            |    И НЕ ЗаказКлиентаТовары.Номенклатура.МенеджерПоставок.ПометкаУдаления
	            |    И ЗаказКлиентаТовары.Номенклатура.МенеджерПоставок <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	            
	            Запрос.УстановитьПараметр("Ссылка", Основание);
	            РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
				    
				    ТекстСообщенияЛичный = "По задаче №" + НомерЗадачи + ", заказ клиента №" + ЭтотОбъект.Основание.Номер + " согласован Лист на поставку товара под заказ";
				    ТекстСообщенияЗадача = "По данной задаче согласован лист на поставку товара под заказ. Автор заказа: " + АвторЗаказа; 
					
					Выборка = РезультатЗапроса.Выбрать();
				    Пока Выборка.Следующий() Цикл
				        МенеджерОП = Выборка.МенеджерОП;
				        РезультатЛичный = АльтерраВзаимодействиеСБитрикс24.ВыполнитьЗапросУниверсальный("5508", "im.message.add", МенеджерОП, ТекстСообщенияЛичный);
				    КонецЦикла;
				    
				    РезультатЗадача = АльтерраВзаимодействиеСБитрикс24.ВыполнитьЗапросУниверсальный("5508", "task.commentitem.add",, ТекстСообщенияЗадача, НомерЗадачи); 
				
				    Если ЗначениеЗаполнено(РезультатЗадача.ОписаниеОшибки) Тогда
						Сообщить("Не получилось отправить данные в задачу Битрикс! " + РезультатЗадача.ОписаниеОшибки);
					Иначе
						ОтправленоМенеджеру = Истина;
					КонецЕсли;
				            
				КонецЕсли;
	            
	        КонецЕсли;
	        
	    КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Функция НайтиНомерЗадачи(Комментарий)
	
	Результат = "";
    ПозицияView = Найти(Комментарий, "view/");
    Если ПозицияView = 0 Тогда
        Возврат Результат;
    КонецЕсли;
    
    ПозицияНачала = ПозицияView + 5;
    
    Для i = ПозицияНачала По СтрДлина(Комментарий) Цикл
        Символ = Сред(Комментарий, i, 1);
        Если Символ >= "0" И Символ <= "9" Тогда
            Результат = Результат + Символ;
        ИначеЕсли Не ПустаяСтрока(Результат) Тогда
            Прервать;
        КонецЕсли;
    КонецЦикла;
	
    Возврат Результат; 
	
КонецФункции



Процедура ЗаписатьВРегистр()
	
	ИспользоватьМАП= НачалоДня(Дата) >= Дата(2019,08,01) И ЗначениеЗаполнено(МАП) И (ОсновнойМенеджер <> МАП);
	
	Движения.Удержания.Записывать = Истина;
	Движения.ИзросходованныйЛимитСогласования.Записывать = Истина;
	Движения.Удержания.Очистить();
	Движения.ИзросходованныйЛимитСогласования.Очистить();
	
	Если Согласован И Не Аннулирован Тогда
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда
			Удержание= Справочники.Удержания.ПросрочкаЗадолжностиПоЛистамСогласования;
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов Тогда
			Удержание= Справочники.Удержания.ПросрочкаЗадолжностиПоЛистамСогласованияТранзиты;
		Иначе
			Удержание= Проблема.Удержание;
		КонецЕсли;
		
		// регистр Удержания
		Если ЗначениеЗаполнено(Удержание) Тогда
			Если Удержание.Тариф <> 0 Тогда 
				Движение = Движения.Удержания.Добавить();
				Движение.Сотрудник = ОсновнойМенеджер;
				Движение.Удержание = Удержание;
				Если ИспользоватьМАП Тогда
					Движение.СуммаУдержания = Удержание.Тариф/2;
				Иначе
					Движение.СуммаУдержания = Удержание.Тариф;
				КонецЕсли;
				Движение.ДатаНачалаДействия = Дата;
				Движение.ДатаОкончанияДействия = ДатаИсполнения;
				Движение.Периодический = Истина;
				Движение.Закрыт = Исполнен;
				Движение.Организация = Организация;
				Движение.Проблема = Проблема;
				
				//Добавляем половину удержания за МАП
				Если ИспользоватьМАП Тогда
					Движение = Движения.Удержания.Добавить();
					Движение.Сотрудник = МАП;
					Движение.Удержание = Удержание;
					Движение.СуммаУдержания = Удержание.Тариф/2;
					Движение.ДатаНачалаДействия = Дата;
					Движение.ДатаОкончанияДействия = ДатаИсполнения;
					Движение.Периодический = Истина;
					Движение.Закрыт = Исполнен;
					Движение.Организация = Организация;
					Движение.Проблема = Проблема;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ВидОперации <> Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления И Не Исполнен Тогда
			Если СуммаСогласования <> 0 Тогда 
				Движение = Движения.ИзросходованныйЛимитСогласования.Добавить();
				Движение.ВидДвижения= ВидДвиженияНакопления.Приход;
				Движение.ВидОперации= ВидОперации;
				Движение.Период = Дата;
				Движение.Согласовано= Согласовано;
				Движение.Сумма= СуммаСогласования;
			КонецЕсли;
			
			Если СуммаОплаты <> 0 Тогда 
				Движение = Движения.ИзросходованныйЛимитСогласования.Добавить();
				Движение.ВидДвижения= ВидДвиженияНакопления.Расход;
				Движение.ВидОперации= ВидОперации;
				Движение.Период = Дата;
				Движение.Согласовано= Согласовано;
				Движение.Сумма= СуммаОплаты;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если (Аннулирован ИЛИ Ссылка.Аннулирован) И (Согласован ИЛИ Ссылка.Согласован) Тогда
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности И Не ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоЗадолженности() Тогда
			Сообщить("Нет прав на аннулирование!");
			Отказ= Истина;
		КонецЕсли;
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов И Не ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоТранзитам() Тогда
			Сообщить("Нет прав на аннулирование!");
			Отказ= Истина;
		КонецЕсли;
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления И Не ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоОформлению() Тогда
			Сообщить("Нет прав на аннулирование!");
			Отказ= Истина;
		КонецЕсли;
		
	ИначеЕсли (Исполнен ИЛИ Ссылка.Исполнен) И Не (Аннулирован ИЛИ Ссылка.Аннулирован) Тогда
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности И Не ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоЗадолженности() Тогда
			Сообщить("Нет прав на исполнение!");
			Отказ= Истина;
		КонецЕсли;
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов И Не ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоТранзитам() Тогда
			Сообщить("Нет прав на исполнение!");
			Отказ= Истина;
		КонецЕсли;
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления И Не ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоОформлению() Тогда
			Сообщить("Нет прав на исполнение!");
			Отказ= Истина;
		КонецЕсли;                                  
		
	ИначеЕсли (Согласован ИЛИ Ссылка.Согласован) И Не (Аннулирован ИЛИ Ссылка.Аннулирован) И Не (Исполнен ИЛИ Ссылка.Исполнен) Тогда
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности И Не ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоЗадолженности() Тогда
			Сообщить("Нет прав на согласование!");
			Отказ= Истина;
		КонецЕсли;
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов И Не ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоТранзитам() Тогда
			Сообщить("Нет прав на согласование!");
			Отказ= Истина;
		КонецЕсли;
		Если ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления И Не ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоОформлению() Тогда
			Сообщить("Нет прав на согласование!");
			Отказ= Истина;
		КонецЕсли;
		
		Если Согласовано.Пользователь <> Пользователи.ТекущийПользователь() И Не ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовЗаДругого() Тогда
			Сообщить("Не вы согласовавали лист!");
			Отказ= Истина;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры



Функция ПроверитьФормуОплатыДатуДоставкиНаСервере(ТолькоПроверка = Ложь)
Если ЗначениеЗаполнено(ЭтотОбъект.Основание) И ЭтотОбъект.Проблема = Справочники.Проблемы.НайтиПоКоду("000000001") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНаДоставкуКлиентуОснования.Ссылка.ПрибытиеНаОтгрузку КАК ДатаДоставки,
			|	ЗаказНаДоставкуКлиентуОснования.Ссылка.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой,
			|	ЗаказНаДоставкуКлиентуОснования.Ссылка.НужнаИнкассация КАК НужнаИнкассация,
			|	ЗаказНаДоставкуКлиентуОснования.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
			|ГДЕ
			|	ЗаказНаДоставкуКлиентуОснования.Документ = &Ссылка
			|	И ЗаказНаДоставкуКлиентуОснования.Ссылка.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Основание);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда     
			Если ТолькоПроверка Тогда  
				Если Не ЭтотОбъект.Аннулирован Тогда
					ОшибкаПоДокументу = "";
					Если ЭтотОбъект.ДатаДоставки <> Выборка.ДатаДоставки Тогда    
						Если ЗначениеЗаполнено(Выборка.ДатаДоставки) Тогда
							ОшибкаПоДокументу = СтрШаблон("%1%2. ","Разные даты доставки - ",Выборка.ДатаДоставки);
						Иначе                            
							ОшибкаПоДокументу = СтрШаблон("%1%2. ","Разные даты доставки - ","Не заполнено");
						КонецЕсли;	
					КонецЕсли;	             
					
					Если Выборка.ОплатаБанковскойКартой Тогда   
						ФормаОплатыПоДокументу = Перечисления.ФормыОплаты.ПлатежнаяКарта;
					ИначеЕсли Выборка.НужнаИнкассация Тогда  
						ФормаОплатыПоДокументу = Перечисления.ФормыОплаты.Наличная;  
					Иначе
						ФормаОплатыПоДокументу = Неопределено;
					КонецЕсли;	
					
					
					Если ФормаОплатыПоДокументу <> ЭтотОбъект.ФормаОплаты Тогда   
						Если ЗначениеЗаполнено(ФормаОплатыПоДокументу) Тогда
							ОшибкаПоДокументу = СтрШаблон("%1%2%3. ",ОшибкаПоДокументу,"Разные формы оплаты - ",ФормаОплатыПоДокументу); 
						Иначе               
							ОшибкаПоДокументу = СтрШаблон("%1%2%3. ",ОшибкаПоДокументу,"Разные формы оплаты - ","Не заполнено");
						КонецЕсли;	
					КонецЕсли;
					Если ОшибкаПоДокументу <> "" Тогда    
						ТекущееСообщение = Новый СообщениеПользователю;
						ТекущееСообщение.Текст = СтрШаблон("%1 %2",ОшибкаПоДокументу,Выборка.Ссылка);
						ТекущееСообщение.КлючДанных = Выборка.Ссылка;
						ТекущееСообщение.Сообщить(); 
						Возврат Истина;
					Иначе
						Возврат Ложь;	
					КонецЕсли;	
				КонецЕсли;
			Иначе	
				ЭтотОбъект.ДатаДоставки = Выборка.ДатаДоставки;         	
				Если Выборка.ОплатаБанковскойКартой Тогда   
					ЭтотОбъект.ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта;
				ИначеЕсли Выборка.НужнаИнкассация Тогда  
					ЭтотОбъект.ФормаОплаты = Перечисления.ФормыОплаты.Наличная;  
				Иначе
					ЭтотОбъект.ФормаОплаты = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
КонецЕсли;	
КонецФункции	  



&Вместо("ПриКопировании")
Процедура ПриКопировании(ОбъектКопирования)
	Автор= Пользователи.ТекущийПользователь();
	Согласовано= Неопределено;
	Согласован= Ложь;
	Исполнен= Ложь;
	Исполнитель= Неопределено;
	Согласователь= Неопределено;
	Аннулирован= Ложь;
КонецПроцедуры

#КонецЕсли
